In [1]:
import pandas as pd
import numpy as np

In [2]:
# pandas is the cross between the items and ditionary 
pd.Series?

In [3]:
animals=["tigers","bear","mouse"]
pd.Series(animals)

0    tigers
1      bear
2     mouse
dtype: object

In [4]:
numbers=[1,2,3,4,45,5,6,6,6,6,6,6,6,6,6,6,6,6,6,6,]
pd.Series(numbers)

0      1
1      2
2      3
3      4
4     45
5      5
6      6
7      6
8      6
9      6
10     6
11     6
12     6
13     6
14     6
15     6
16     6
17     6
18     6
19     6
dtype: int64

In [5]:
import numpy as np
np.nan == None

False

In [6]:
np.nan == np.nan

False

In [7]:
# nan means not a number  
np.isnan(np.nan)

True

In [8]:
# nan and none are same but numeric value traeted diffrently for efficient reasons

In [9]:
# we are creating a dictionaru 
Sports={
    "archery":"gokul js",
    "Age":24,
    "college":"cmrit"
}
# when we convert dictonaries to pandas data frame keys are used as special index 
s = pd.Series(Sports)

In [10]:
s

archery    gokul js
Age              24
college       cmrit
dtype: object

In [11]:
# now we only need index from the pandas series 
s.index

Index(['archery', 'Age', 'college'], dtype='object')

In [12]:
# querying the series 
# loc and iloc attribute

In [13]:
# we are creating a dictionaru 
Sports={
    "archery":"gokul js",
    "Age":24,
    "college":"cmrit"
}
# when we convert dictonaries to pandas data frame keys are used as special index 
s = pd.Series(Sports)

In [14]:
s

archery    gokul js
Age              24
college       cmrit
dtype: object

In [15]:
# iloc attribute is used to access the spicfic index by numeric value 
s.iloc[2]

'cmrit'

In [16]:
# loc attribute us going to acces index by using special index value
s.loc["Age"]

24

In [17]:
s[2]

'cmrit'

In [18]:
s['Age']

24

In [19]:
list=[i for i in range(0,100)]

In [20]:
list

[0,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 11,
 12,
 13,
 14,
 15,
 16,
 17,
 18,
 19,
 20,
 21,
 22,
 23,
 24,
 25,
 26,
 27,
 28,
 29,
 30,
 31,
 32,
 33,
 34,
 35,
 36,
 37,
 38,
 39,
 40,
 41,
 42,
 43,
 44,
 45,
 46,
 47,
 48,
 49,
 50,
 51,
 52,
 53,
 54,
 55,
 56,
 57,
 58,
 59,
 60,
 61,
 62,
 63,
 64,
 65,
 66,
 67,
 68,
 69,
 70,
 71,
 72,
 73,
 74,
 75,
 76,
 77,
 78,
 79,
 80,
 81,
 82,
 83,
 84,
 85,
 86,
 87,
 88,
 89,
 90,
 91,
 92,
 93,
 94,
 95,
 96,
 97,
 98,
 99]

In [21]:
s=pd.Series(list)
s

0      0
1      1
2      2
3      3
4      4
      ..
95    95
96    96
97    97
98    98
99    99
Length: 100, dtype: int64

In [22]:
%%timeit -n 100
k=np.sum(s)
k

70.9 µs ± 1.89 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [23]:
%%timeit -n 100

total=0
for i in range(len(list)):
    total=total+list[i]
total

9.87 µs ± 1.06 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [24]:
s +=2
s.head()

0    2
1    3
2    4
3    5
4    6
dtype: int64

In [25]:
%%timeit -n 5
s=pd.Series(np.random.randint(0,1000,10000))
for label,value in s.iteritems():
    s.loc[label]+=2
s

782 ms ± 21.3 ms per loop (mean ± std. dev. of 7 runs, 5 loops each)

In [26]:
%%timeit -n 5
s=pd.Series(np.random.randint(0,1000,10000))
s+=2
s

332 µs ± 45.4 µs per loop (mean ± std. dev. of 7 runs, 5 loops each)

In [27]:
#  getting started with dataframe 
# data anlaysis and

In [28]:
purchase1=pd.Series({
    
        "name":"gokul",
        "cost":2000,
        "purchase":"yes"
    
    
}
)
purchase2=pd.Series(
{
    
        "name":"gokul",
        "cost":2000,
        "purchase":"yes"
    
    
}
)
purchase3=pd.Series(
        {
    
        "name":"gokul",
        "cost":2000,
        "purchase":"yes"
    
    
}
)
df=pd.DataFrame([purchase1,purchase2,purchase3 ],index=['store1','store2','store3'])
df.head()

         name  cost purchase
store1  gokul  2000      yes
store2  gokul  2000      yes
store3  gokul  2000      yes

In [29]:
df.loc['store2']

name        gokul
cost         2000
purchase      yes
Name: store2, dtype: object

In [30]:
type(df.loc['store2'])

pandas.core.series.Series

In [31]:
s=df['cost']
k=np.sum(s)
k

6000

In [32]:
# in pandas columns alway have a selection 
df.loc['store1']['cost']

2000

In [33]:
df.loc[['store1','store2'],['name','cost']]

         name  cost
store1  gokul  2000
store2  gokul  2000

In [34]:
# dropping data in data frame 
df.drop('store1')

         name  cost purchase
store2  gokul  2000      yes
store3  gokul  2000      yes

In [35]:
df['location']=None

In [36]:
df.head()

         name  cost purchase location
store1  gokul  2000      yes     None
store2  gokul  2000      yes     None
store3  gokul  2000      yes     None

In [37]:
df['cost']=df['cost']*0.2

df.head()

         name   cost purchase location
store1  gokul  400.0      yes     None
store2  gokul  400.0      yes     None
store3  gokul  400.0      yes     None

In [38]:
import pandas as pd

In [39]:
df=pd.read_csv("olympics.csv")
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,NaN,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !,02 !,03 !,Total,№ Games,01 !,02 !,03 !,Combined total
1,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
2,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
3,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
4,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12

In [41]:
df=pd.read_csv("olympics.csv",index_col=0,skiprows=1)
df.head()

,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !.1,02 !.1,03 !.1,Total.1,№ Games,01 !.2,02 !.2,03 !.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [42]:
# all the index values
df.index

Index(['Afghanistan (AFG)', 'Algeria (ALG)', 'Argentina (ARG)',
       'Armenia (ARM)', 'Australasia (ANZ) [ANZ]', 'Australia (AUS) [AUS] [Z]',
       'Austria (AUT)', 'Azerbaijan (AZE)', 'Bahamas (BAH)', 'Bahrain (BRN)',
       ...
       'Uzbekistan (UZB)', 'Venezuela (VEN)', 'Vietnam (VIE)',
       'Virgin Islands (ISV)', 'Yugoslavia (YUG) [YUG]',
       'Independent Olympic Participants (IOP) [IOP]', 'Zambia (ZAM) [ZAM]',
       'Zimbabwe (ZIM) [ZIM]', 'Mixed team (ZZX) [ZZX]', 'Totals'],
      dtype='object', length=147)

In [43]:
# all the columns values
df.columns

Index(['№ Summer', '01 !', '02 !', '03 !', 'Total', '№ Winter', '01 !.1',
       '02 !.1', '03 !.1', 'Total.1', '№ Games', '01 !.2', '02 !.2', '03 !.2',
       'Combined total'],
      dtype='object')

In [45]:
for col in df.columns:
    if col[:2]=='01':
        df.rename(columns={col:'gold'+col[4:]},inplace=True)
    elif col[:2] == '02':
        df.rename(columns={col:'silver'+col[4:1]},inplace=True)
    elif col[:2] == '03':
        df.rename(columns={col:'bronze'+col[4:1]},inplace=True)
df.head()

,№ Summer,gold,silver,bronze,Total,№ Winter,gold.1,silver,bronze,Total.1,№ Games,gold.2,silver,bronze,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [46]:
# querrying a dataframe 
# boolian masking 
df['gold']>0

Afghanistan (AFG)                               False
Algeria (ALG)                                    True
Argentina (ARG)                                  True
Armenia (ARM)                                    True
Australasia (ANZ) [ANZ]                          True
                                                ...
Independent Olympic Participants (IOP) [IOP]    False
Zambia (ZAM) [ZAM]                              False
Zimbabwe (ZIM) [ZIM]                             True
Mixed team (ZZX) [ZZX]                           True
Totals                                           True
Name: gold, Length: 147, dtype: bool

In [49]:
only_gold=df.where(df['gold']>0)
only_gold['gold'].count()

100

In [50]:
only_gold=only_gold.dropna()
only_gold
# used to remove null values

,№ Summer,gold,silver,bronze,Total,№ Winter,gold.1,silver,bronze,Total.1,№ Games,gold.2,silver,bronze,Combined total
Algeria (ALG),12.0,5.0,2.0,8.0,15.0,3.0,0.0,0.0,0.0,0.0,15.0,5.0,2.0,8.0,15.0
Argentina (ARG),23.0,18.0,24.0,28.0,70.0,18.0,0.0,0.0,0.0,0.0,41.0,18.0,24.0,28.0,70.0
Armenia (ARM),5.0,1.0,2.0,9.0,12.0,6.0,0.0,0.0,0.0,0.0,11.0,1.0,2.0,9.0,12.0
Australasia (ANZ) [ANZ],2.0,3.0,4.0,5.0,12.0,0.0,0.0,0.0,0.0,0.0,2.0,3.0,4.0,5.0,12.0
Australia (AUS) [AUS] [Z],25.0,139.0,152.0,177.0,468.0,18.0,5.0,3.0,4.0,12.0,43.0,144.0,155.0,181.0,480.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Venezuela (VEN),17.0,2.0,2.0,8.0,12.0,4.0,0.0,0.0,0.0,0.0,21.0,2.0,2.0,8.0,12.0
Yugoslavia (YUG) [YUG],16.0,26.0,29.0,28.0,83.0,14.0,0.0,3.0,1.0,4.0,30.0,26.0,32.0,29.0,87.0
Zimbabwe (ZIM) [ZIM],12.0,3.0,4.0,1.0,8.0,1.0,0.0,0.0,0.0,0.0,13.0,3.0,4.0,1.0,8.0
Mixed team (ZZX) [ZZX],3.0,8.0,5.0,4.0,17.0,0.0,0.0,0.0,0.0,0.0,3.0,8.0,5.0,4.0,17.0
Totals,27.0,4809.0,4775.0,5130.0,14714.0,22.0,959.0,958.0,948.0,2865.0,49.0,5768.0,5733.0,6078.0,17579.0

In [52]:
# boolian masking with logical operator 
df[ (df['gold.1']>0) & (df['gold']==0)]

,№ Summer,gold,silver,bronze,Total,№ Winter,gold.1,silver,bronze,Total.1,№ Games,gold.2,silver,bronze,Combined total
Liechtenstein (LIE),16,0,0,0,0,18,2,2,5,9,34,2,2,5,9

In [ ]:
# indexing dataframes

In [54]:
for i in range(100):
    k=df.iloc[i]
k

№ Summer           20
gold               64
silver             82
bronze            125
Total             271
№ Winter           22
gold.1              6
silver              7
bronze              7
Total.1            20
№ Games            42
gold.2             70
silver             89
bronze            132
Combined total    291
Name: Poland (POL), dtype: int64

In [55]:
df

,№ Summer,gold,silver,bronze,Total,№ Winter,gold.1,silver,bronze,Total.1,№ Games,gold.2,silver,bronze,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Independent Olympic Participants (IOP) [IOP],1,0,1,2,3,0,0,0,0,0,1,0,1,2,3
Zambia (ZAM) [ZAM],12,0,1,1,2,0,0,0,0,0,12,0,1,1,2
Zimbabwe (ZIM) [ZIM],12,3,4,1,8,1,0,0,0,0,13,3,4,1,8
Mixed team (ZZX) [ZZX],3,8,5,4,17,0,0,0,0,0,3,8,5,4,17
Totals,27,4809,4775,5130,14714,22,959,958,948,2865,49,5768,5733,6078,17579

In [56]:
df['country']=df.index
df=df.set_index('gold')
df.head()

,№ Summer,silver,bronze,Total,№ Winter,gold.1,silver,bronze,Total.1,№ Games,gold.2,silver,bronze,Combined total,country
gold,,,,,,,,,,,,,,,
0,13,0,2,2,0,0,0,0,0,13,0,0,2,2,Afghanistan (AFG)
5,12,2,8,15,3,0,0,0,0,15,5,2,8,15,Algeria (ALG)
18,23,24,28,70,18,0,0,0,0,41,18,24,28,70,Argentina (ARG)
1,5,2,9,12,6,0,0,0,0,11,1,2,9,12,Armenia (ARM)
3,2,4,5,12,0,0,0,0,0,2,3,4,5,12,Australasia (ANZ) [ANZ]

In [57]:
df=df.reset_index()
df.head()

,gold,№ Summer,silver,bronze,Total,№ Winter,gold.1,silver,bronze,Total.1,№ Games,gold.2,silver,bronze,Combined total,country
0,0,13,0,2,2,0,0,0,0,0,13,0,0,2,2,Afghanistan (AFG)
1,5,12,2,8,15,3,0,0,0,0,15,5,2,8,15,Algeria (ALG)
2,18,23,24,28,70,18,0,0,0,0,41,18,24,28,70,Argentina (ARG)
3,1,5,2,9,12,6,0,0,0,0,11,1,2,9,12,Armenia (ARM)
4,3,2,4,5,12,0,0,0,0,0,2,3,4,5,12,Australasia (ANZ) [ANZ]